DovPearX/vesc_express/sdkconfig.defaults.esp32c3
#
# HTTP Server
#
# default:
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# default:
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# default:
# CONFIG_HTTPD_WS_SUPPORT is not set
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# end of HTTP Server

#
# ESP HTTPS OTA
#
# default:
# CONFIG_ESP_HTTPS_OTA_DECRYPT_CB is not set
# default:
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set
# default:
CONFIG_ESP_HTTPS_OTA_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_OTA_ENABLE_PARTIAL_DOWNLOAD is not set
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# default:
# CONFIG_ESP_HTTPS_SERVER_ENABLE is not set
# default:
CONFIG_ESP_HTTPS_SERVER_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK is not set
# end of ESP HTTPS server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#
# default:
# CONFIG_ESP32C3_REV_MIN_0 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_1 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_2 is not set
# default:
CONFIG_ESP32C3_REV_MIN_3=y
# default:
# CONFIG_ESP32C3_REV_MIN_4 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_101 is not set
# default:
CONFIG_ESP32C3_REV_MIN_FULL=3
# default:
CONFIG_ESP_REV_MIN_FULL=3

#
# Maximum Supported ESP32-C3 Revision (Rev v1.99)
#
# default:
CONFIG_ESP32C3_REV_MAX_FULL=199
# default:
CONFIG_ESP_REV_MAX_FULL=199
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199

#
# Maximum Supported ESP32-C3 eFuse Block Revision (eFuse Block Rev v1.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_BT=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_ETH=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES_TWO is not set
# default:
CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
# default:
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU is not set
# default:
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=0
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS is not set
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
# default:
# CONFIG_RTC_CLK_SRC_EXT_OSC is not set
# default:
# CONFIG_RTC_CLK_SRC_INT_8MD256 is not set
# default:
CONFIG_RTC_CLK_CAL_CYCLES=1024
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_3 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector
# end of Power Supplier

# default:
CONFIG_ESP_INTR_IN_IRAM=y
# end of Hardware Settings

#
# ESP-Driver:LCD Controller Configurations
#
# default:
# CONFIG_LCD_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:LCD Controller Configurations

#
# LibC
#
# CONFIG_LIBC_NEWLIB is not set
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# default:
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=y
# default:
CONFIG_LIBC_ASSERT_BUFFER_SIZE=200
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# default:
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=y
# default:
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# default:
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# default:
# CONFIG_ESP_NETIF_LOOPBACK is not set
# default:
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
# default:
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# default:
CONFIG_ESP_PHY_ENABLED=y
# default:
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# default:
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
# default:
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
# default:
CONFIG_ESP_PHY_MAX_TX_POWER=20
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
# default:
CONFIG_ESP_PHY_ENABLE_USB=y
CONFIG_ESP_PHY_ENABLE_CERT_TEST=y
# default:
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
# default:
# CONFIG_ESP_PHY_RF_CAL_NONE is not set
# default:
# CONFIG_ESP_PHY_RF_CAL_FULL is not set
# default:
CONFIG_ESP_PHY_CALIBRATION_MODE=0
# default:
CONFIG_ESP_PHY_PLL_TRACK_PERIOD_MS=1000
# default:
# CONFIG_ESP_PHY_PLL_TRACK_DEBUG is not set
# default:
# CONFIG_ESP_PHY_RECORD_USED_TIME is not set
# CONFIG_ESP_PHY_IRAM_OPT is not set
# default:
# CONFIG_ESP_PHY_DEBUG is not set
# default:
CONFIG_ESP_PHY_ENABLE_VERSION_PRINT=y
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
CONFIG_PM_SLP_IRAM_OPT=y
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP is not set
# end of Power Management

#
# ESP PSRAM
#

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# end of ESP Security Specific

#
# ESP-STDIO
#
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# default:
CONFIG_ESP_CONSOLE_UART_NUM=-1
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=-1
# end of ESP-STDIO

#
# ESP System Settings
#
# default:
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160
# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# default:
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
# default:
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# default:
CONFIG_ESP_SYSTEM_NO_BACKTRACE=y
# default:
# CONFIG_ESP_SYSTEM_USE_EH_FRAME is not set
# default:
# CONFIG_ESP_SYSTEM_USE_FRAME_POINTER is not set
# default:
CONFIG_ESP_SYSTEM_MEMPROT=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS_LOCK=y
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3072
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# default:
CONFIG_ESP_INT_WDT=y
# default:
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# default:
CONFIG_ESP_TASK_WDT_EN=y
# default:
CONFIG_ESP_TASK_WDT_INIT=y
# default:
# CONFIG_ESP_TASK_WDT_PANIC is not set
# default:
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# default:
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# default:
CONFIG_ESP_DEBUG_OCDAWARE=y
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# default:
CONFIG_ESP_SYSTEM_HW_STACK_GUARD=y
# default:
CONFIG_ESP_SYSTEM_HW_PC_RECORD=y
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# default:
CONFIG_ESP_TIMER_IN_IRAM=y
# default:
# CONFIG_ESP_TIMER_PROFILING is not set
# default:
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
# default:
CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
# default:
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# default:
# CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL is not set
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# default:
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# default:
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y
# end of ESP Timer (High Resolution Timer)

#
# ESP Trace Configuration
#
# default:
# CONFIG_ESP_TRACE_LIB_EXTERNAL is not set
# default:
CONFIG_ESP_TRACE_LIB_NONE=y
# default:
CONFIG_ESP_TRACE_LIB_NAME="none"
# default:
# CONFIG_ESP_TRACE_TRANSPORT_APPTRACE is not set
# default:
CONFIG_ESP_TRACE_TRANSPORT_NONE=y
# default:
CONFIG_ESP_TRACE_TRANSPORT_NAME="none"
# end of ESP Trace Configuration

#
# Wi-Fi
#
# default:
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
# CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER is not set
# default:
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=3
# default:
CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER=y
# default:
# CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER is not set
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=0
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=4
# default:
# CONFIG_ESP_WIFI_CSI_ENABLED is not set
# CONFIG_ESP_WIFI_AMPDU_TX_ENABLED is not set
# CONFIG_ESP_WIFI_AMPDU_RX_ENABLED is not set
# CONFIG_ESP_WIFI_NVS_ENABLED is not set
# default:
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6
# CONFIG_ESP_WIFI_IRAM_OPT is not set
# default:
# CONFIG_ESP_WIFI_EXTRA_IRAM_OPT is not set
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
# default:
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
# CONFIG_ESP_WIFI_ENABLE_SAE_PK is not set
# CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set
# default:
CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# default:
# CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
CONFIG_ESP_WIFI_FTM_ENABLE=y
# default:
CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT=y
# default:
CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT=y
# default:
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
# default:
# CONFIG_ESP_WIFI_GCMP_SUPPORT is not set
# default:
CONFIG_ESP_WIFI_GMAC_SUPPORT=y
# default:
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_BEACON_LOST_OPT is not set
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=6
# default:
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=y
# default:
# CONFIG_ESP_WIFI_WAPI_PSK is not set
# default:
# CONFIG_ESP_WIFI_11KV_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_MBO_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_DPP_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_11R_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR is not set

#
# WPS Configuration Options
#
# default:
# CONFIG_ESP_WIFI_WPS_STRICT is not set
# default:
# CONFIG_ESP_WIFI_WPS_PASSPHRASE is not set
# default:
# CONFIG_ESP_WIFI_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

# default:
# CONFIG_ESP_WIFI_DEBUG_PRINT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_PASSIVE_HIDDEN_AP_SUPPORT is not set
# end of Wi-Fi

#
# Core dump
#
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH is not set
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_UART is not set
# default:
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
# end of Core dump

#
# FAT Filesystem support
#
CONFIG_FATFS_VOLUME_COUNT=1
# default:
# CONFIG_FATFS_LFN_NONE is not set
# default:
CONFIG_FATFS_LFN_HEAP=y
# default:
# CONFIG_FATFS_LFN_STACK is not set
CONFIG_FATFS_SECTOR_512=y
# CONFIG_FATFS_SECTOR_4096 is not set
# default:
# CONFIG_FATFS_CODEPAGE_DYNAMIC is not set
# default:
CONFIG_FATFS_CODEPAGE_437=y
# default:
# CONFIG_FATFS_CODEPAGE_720 is not set
# default:
# CONFIG_FATFS_CODEPAGE_737 is not set
# default:
# CONFIG_FATFS_CODEPAGE_771 is not set
# default:
# CONFIG_FATFS_CODEPAGE_775 is not set
# default:
# CONFIG_FATFS_CODEPAGE_850 is not set
# default:
# CONFIG_FATFS_CODEPAGE_852 is not set
# default:
# CONFIG_FATFS_CODEPAGE_855 is not set
# default:
# CONFIG_FATFS_CODEPAGE_857 is not set
# default:
# CONFIG_FATFS_CODEPAGE_860 is not set
# default:
# CONFIG_FATFS_CODEPAGE_861 is not set
# default:
# CONFIG_FATFS_CODEPAGE_862 is not set
# default:
# CONFIG_FATFS_CODEPAGE_863 is not set
# default:
# CONFIG_FATFS_CODEPAGE_864 is not set
# default:
# CONFIG_FATFS_CODEPAGE_865 is not set
# default:
# CONFIG_FATFS_CODEPAGE_866 is not set
# default:
# CONFIG_FATFS_CODEPAGE_869 is not set
# default:
# CONFIG_FATFS_CODEPAGE_932 is not set
# default:
# CONFIG_FATFS_CODEPAGE_936 is not set
# default:
# CONFIG_FATFS_CODEPAGE_949 is not set
# default:
# CONFIG_FATFS_CODEPAGE_950 is not set
# default:
CONFIG_FATFS_CODEPAGE=437
CONFIG_FATFS_MAX_LFN=128
# default:
CONFIG_FATFS_API_ENCODING_ANSI_OEM=y
# default:
# CONFIG_FATFS_API_ENCODING_UTF_8 is not set
# default:
CONFIG_FATFS_FS_LOCK=0
# default:
CONFIG_FATFS_TIMEOUT_MS=10000
# CONFIG_FATFS_PER_FILE_CACHE is not set
CONFIG_FATFS_USE_FASTSEEK=y
# default:
CONFIG_FATFS_USE_STRFUNC_NONE=y
# default:
# CONFIG_FATFS_USE_STRFUNC_WITHOUT_CRLF_CONV is not set
# default:
# CONFIG_FATFS_USE_STRFUNC_WITH_CRLF_CONV is not set
# default:
CONFIG_FATFS_FAST_SEEK_BUFFER_SIZE=64
# default:
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=0
# default:
# CONFIG_FATFS_IMMEDIATE_FSYNC is not set
# default:
# CONFIG_FATFS_USE_LABEL is not set
# default:
CONFIG_FATFS_LINK_LOCK=y
# CONFIG_FATFS_USE_DYN_BUFFERS is not set

#
# File system free space calculation behavior
#
# default:
CONFIG_FATFS_DONT_TRUST_FREE_CLUSTER_CNT=0
# default:
CONFIG_FATFS_DONT_TRUST_LAST_ALLOC=0
# end of File system free space calculation behavior
# end of FAT Filesystem support

#
# FreeRTOS
#

#
# Kernel
#
# default:
# CONFIG_FREERTOS_SMP is not set
# default:
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000
# default:
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE is not set
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL is not set
# default:
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# default:
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
# default:
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
# default:
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set
# default:
# CONFIG_FREERTOS_USE_TICK_HOOK is not set
# default:
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
# default:
# CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY is not set
# default:
CONFIG_FREERTOS_USE_TIMERS=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_NAME="Tmr Svc"
# default:
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0 is not set
# default:
CONFIG_FREERTOS_TIMER_TASK_NO_AFFINITY=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_CORE_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
# default:
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# default:
CONFIG_FREERTOS_TIMER_QUEUE_LENGTH=10
# default:
CONFIG_FREERTOS_QUEUE_REGISTRY_SIZE=0
# default:
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=1
# default:
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# default:
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
# default:
# CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES is not set
# default:
# CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID is not set
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# default:
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U32=y
# default:
# CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64 is not set
# default:
# CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG is not set
# end of Kernel

