DovPearX/vesc_express/sdkconfig.defaults.esp32c3
#
# Port
#
# default:
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK is not set
# default:
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
# default:
# CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK is not set
# default:
CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER=y
CONFIG_FREERTOS_ISR_STACKSIZE=2096
# CONFIG_FREERTOS_INTERRUPT_BACKTRACE is not set
# default:
CONFIG_FREERTOS_TICK_SUPPORT_SYSTIMER=y
# default:
CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL1=y
# default:
# CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL3 is not set
# default:
CONFIG_FREERTOS_SYSTICK_USES_SYSTIMER=y
# default:
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
# default:
# CONFIG_FREERTOS_IN_IRAM is not set
# default:
# CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE is not set
# end of Port

#
# Extra
#
# end of Extra

# default:
CONFIG_FREERTOS_PORT=y
# default:
CONFIG_FREERTOS_NO_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
# default:
CONFIG_FREERTOS_DEBUG_OCDAWARE=y
# default:
CONFIG_FREERTOS_NUMBER_OF_CORES=1
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
# CONFIG_HAL_ASSERTION_EQUALS_SYSTEM is not set
# CONFIG_HAL_ASSERTION_DISABLE is not set
CONFIG_HAL_ASSERTION_SILENT=y
# default:
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=1
# default:
CONFIG_HAL_GPIO_USE_ROM_IMPL=y
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
# default:
CONFIG_HEAP_POISONING_DISABLED=y
# default:
# CONFIG_HEAP_POISONING_LIGHT is not set
# default:
# CONFIG_HEAP_POISONING_COMPREHENSIVE is not set
# default:
CONFIG_HEAP_TRACING_OFF=y
# default:
# CONFIG_HEAP_TRACING_STANDALONE is not set
# default:
# CONFIG_HEAP_TRACING_TOHOST is not set
# default:
# CONFIG_HEAP_USE_HOOKS is not set
# default:
# CONFIG_HEAP_TASK_TRACKING is not set
# default:
# CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS is not set
# default:
# CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH is not set
# end of Heap memory debugging

#
# Log
#
# default:
CONFIG_LOG_VERSION_1=y
# default:
# CONFIG_LOG_VERSION_2 is not set
# default:
CONFIG_LOG_VERSION=1

#
# Log Level
#
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
# CONFIG_LOG_DEFAULT_LEVEL_ERROR is not set
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
# CONFIG_LOG_DEFAULT_LEVEL_INFO is not set
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL=0
# default:
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_ERROR is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_WARN is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_INFO is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_MAXIMUM_LEVEL=0

#
# Level Settings
#
# default:
# CONFIG_LOG_MASTER_LEVEL is not set
# default:
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_NONE is not set
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_LINKED_LIST is not set
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_AND_LINKED_LIST=y
# default:
# CONFIG_LOG_TAG_LEVEL_CACHE_ARRAY is not set
# default:
CONFIG_LOG_TAG_LEVEL_CACHE_BINARY_MIN_HEAP=y
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_SIZE=31
# end of Level Settings
# end of Log Level

#
# Format
#
# default:
# CONFIG_LOG_COLORS is not set
# default:
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# default:
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Format

#
# Settings
#
# default:
CONFIG_LOG_MODE_TEXT_EN=y
# default:
CONFIG_LOG_MODE_TEXT=y
# end of Settings

# default:
CONFIG_LOG_IN_IRAM=y
# end of Log

#
# LWIP
#
# default:
CONFIG_LWIP_ENABLE=y
# default:
CONFIG_LWIP_LOCAL_HOSTNAME="espressif"
# default:
CONFIG_LWIP_TCPIP_TASK_PRIO=18
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_TCPIP_CORE_LOCKING_INPUT=y
# default:
# CONFIG_LWIP_CHECK_THREAD_SAFETY is not set
# default:
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
# default:
# CONFIG_LWIP_L2_TO_L3_COPY is not set
# default:
# CONFIG_LWIP_IRAM_OPTIMIZATION is not set
# default:
# CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION is not set
# default:
CONFIG_LWIP_TIMERS_ONDEMAND=y
CONFIG_LWIP_MAX_SOCKETS=5
# default:
# CONFIG_LWIP_USE_ONLY_LWIP_SELECT is not set
# default:
# CONFIG_LWIP_SO_LINGER is not set
# default:
CONFIG_LWIP_SO_REUSE=y
# CONFIG_LWIP_SO_REUSE_RXTOALL is not set
# default:
# CONFIG_LWIP_SO_RCVBUF is not set
# default:
# CONFIG_LWIP_NETBUF_RECVINFO is not set
# default:
CONFIG_LWIP_IP_DEFAULT_TTL=64
# CONFIG_LWIP_IP4_FRAG is not set
# default:
# CONFIG_LWIP_IP4_REASSEMBLY is not set
# default:
CONFIG_LWIP_IP_REASS_MAX_PBUFS=10
# default:
# CONFIG_LWIP_IP_FORWARD is not set
# default:
# CONFIG_LWIP_STATS is not set
# default:
CONFIG_LWIP_ESP_GRATUITOUS_ARP=y
# default:
CONFIG_LWIP_GARP_TMR_INTERVAL=60
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
# default:
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=y
# default:
# CONFIG_LWIP_DHCP_DOES_ACD_CHECK is not set
# default:
# CONFIG_LWIP_DHCP_DOES_NOT_CHECK_OFFERED_IP is not set
# default:
# CONFIG_LWIP_DHCP_DISABLE_CLIENT_ID is not set
# default:
CONFIG_LWIP_DHCP_DISABLE_VENDOR_CLASS_ID=y
# default:
# CONFIG_LWIP_DHCP_RESTORE_LAST_IP is not set
# default:
CONFIG_LWIP_DHCP_OPTIONS_LEN=69
# default:
CONFIG_LWIP_NUM_NETIF_CLIENT_DATA=0
# default:
CONFIG_LWIP_DHCP_COARSE_TIMER_SECS=1

#
# DHCP server
#
# default:
CONFIG_LWIP_DHCPS=y
# default:
CONFIG_LWIP_DHCPS_REPORT_CLIENT_HOSTNAME=y
# default:
CONFIG_LWIP_DHCPS_LEASE_UNIT=60
# default:
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8
# default:
CONFIG_LWIP_DHCPS_MAX_HOSTNAME_LEN=64
# default:
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=y
# end of DHCP server

# default:
# CONFIG_LWIP_AUTOIP is not set
# default:
CONFIG_LWIP_IPV4=y
# CONFIG_LWIP_IPV6 is not set
# default:
# CONFIG_LWIP_NETIF_STATUS_CALLBACK is not set
# default:
# CONFIG_LWIP_NETIF_LINK_CALLBACK is not set
# CONFIG_LWIP_NETIF_LOOPBACK is not set

#
# TCP
#
CONFIG_LWIP_MAX_ACTIVE_TCP=8
CONFIG_LWIP_MAX_LISTENING_TCP=8
# default:
CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION=y
# default:
CONFIG_LWIP_TCP_MAXRTX=12
# default:
CONFIG_LWIP_TCP_SYNMAXRTX=12
CONFIG_LWIP_TCP_MSS=1024
# default:
CONFIG_LWIP_TCP_TMR_INTERVAL=250
# default:
CONFIG_LWIP_TCP_MSL=60000
# default:
CONFIG_LWIP_TCP_FIN_WAIT_TIMEOUT=20000
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2440
CONFIG_LWIP_TCP_WND_DEFAULT=2440
# default:
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
# default:
CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=6
# CONFIG_LWIP_TCP_QUEUE_OOSEQ is not set
# CONFIG_LWIP_TCP_OVERSIZE_MSS is not set
CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS=y
# CONFIG_LWIP_TCP_OVERSIZE_DISABLE is not set
# default:
CONFIG_LWIP_TCP_RTO_TIME=1500
# end of TCP

#
# UDP
#
CONFIG_LWIP_MAX_UDP_PCBS=8
# default:
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
# end of UDP

#
# Checksums
#
# default:
# CONFIG_LWIP_CHECKSUM_CHECK_IP is not set
# default:
# CONFIG_LWIP_CHECKSUM_CHECK_UDP is not set
# default:
CONFIG_LWIP_CHECKSUM_CHECK_ICMP=y
# end of Checksums

# default:
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072
# default:
CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# default:
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0 is not set
# default:
CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# default:
# CONFIG_LWIP_PPP_SUPPORT is not set
# default:
# CONFIG_LWIP_SLIP_SUPPORT is not set

#
# ICMP
#
# default:
CONFIG_LWIP_ICMP=y
# default:
# CONFIG_LWIP_MULTICAST_PING is not set
# default:
# CONFIG_LWIP_BROADCAST_PING is not set
# end of ICMP

#
# LWIP RAW API
#
# default:
CONFIG_LWIP_MAX_RAW_PCBS=16
# end of LWIP RAW API

#
# SNTP
#
# default:
CONFIG_LWIP_SNTP_MAX_SERVERS=1
# default:
# CONFIG_LWIP_DHCP_GET_NTP_SRV is not set
# default:
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
# default:
CONFIG_LWIP_SNTP_STARTUP_DELAY=y
# default:
CONFIG_LWIP_SNTP_MAXIMUM_STARTUP_DELAY=5000
# end of SNTP

#
# DNS
#
# default:
CONFIG_LWIP_DNS_MAX_HOST_IP=1
# default:
CONFIG_LWIP_DNS_MAX_SERVERS=3
# default:
# CONFIG_LWIP_FALLBACK_DNS_SERVER_SUPPORT is not set
# default:
# CONFIG_LWIP_DNS_SETSERVER_WITH_NETIF is not set
# end of DNS

# default:
CONFIG_LWIP_BRIDGEIF_MAX_PORTS=7
# CONFIG_LWIP_ESP_LWIP_ASSERT is not set

#
# Hooks
#
# default:
# CONFIG_LWIP_HOOK_TCP_ISN_NONE is not set
# default:
CONFIG_LWIP_HOOK_TCP_ISN_DEFAULT=y
# default:
# CONFIG_LWIP_HOOK_TCP_ISN_CUSTOM is not set
# default:
CONFIG_LWIP_HOOK_DHCP_EXTRA_OPTION_NONE=y
# default:
# CONFIG_LWIP_HOOK_DHCP_EXTRA_OPTION_DEFAULT is not set
# default:
# CONFIG_LWIP_HOOK_DHCP_EXTRA_OPTION_CUSTOM is not set
# default:
CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_NONE=y
# default:
# CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_DEFAULT is not set
# default:
# CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_CUSTOM is not set
# default:
CONFIG_LWIP_HOOK_DNS_EXT_RESOLVE_NONE=y
# default:
# CONFIG_LWIP_HOOK_DNS_EXT_RESOLVE_CUSTOM is not set
# end of Hooks

# default:
# CONFIG_LWIP_DEBUG is not set
# end of LWIP

#
# mbedTLS
#

#
# Core Configuration
#
# default:
CONFIG_MBEDTLS_VER_4_X_SUPPORT=y
# default:
# CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_SIZE=y
# default:
# CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF is not set
# default:
CONFIG_MBEDTLS_FS_IO=y
# CONFIG_MBEDTLS_THREADING_C is not set
# CONFIG_MBEDTLS_ERROR_STRINGS is not set
# default:
# CONFIG_MBEDTLS_ERROR_STRERROR_DUMMY is not set
# default:
CONFIG_MBEDTLS_VERSION_C=y
# default:
CONFIG_MBEDTLS_HAVE_TIME=y
# default:
# CONFIG_MBEDTLS_PLATFORM_TIME_ALT is not set
# default:
# CONFIG_MBEDTLS_HAVE_TIME_DATE is not set
# default:
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y
# default:
# CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC is not set
# default:
# CONFIG_MBEDTLS_CUSTOM_MEM_ALLOC is not set
# default:
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=1024
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=1024
# default:
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set
# default:
# CONFIG_MBEDTLS_VERSION_FEATURES is not set
# default:
# CONFIG_MBEDTLS_DEBUG is not set
# default:
CONFIG_MBEDTLS_SELF_TEST=y
# end of Core Configuration

#
# Certificates
#
# default:
CONFIG_MBEDTLS_X509_USE_C=y
# default:
CONFIG_MBEDTLS_PEM_PARSE_C=y
# default:
CONFIG_MBEDTLS_PEM_WRITE_C=y
# default:
CONFIG_MBEDTLS_PK_C=y
# default:
CONFIG_MBEDTLS_PK_PARSE_C=y
# default:
CONFIG_MBEDTLS_PK_WRITE_C=y
# default:
# CONFIG_MBEDTLS_X509_REMOVE_INFO is not set
# default:
CONFIG_MBEDTLS_X509_CRL_PARSE_C=y
# default:
CONFIG_MBEDTLS_X509_CRT_PARSE_C=y
# default:
CONFIG_MBEDTLS_X509_CSR_PARSE_C=y
# default:
# CONFIG_MBEDTLS_X509_CREATE_C is not set
# default:
CONFIG_MBEDTLS_X509_RSASSA_PSS_SUPPORT=y
# default:
# CONFIG_MBEDTLS_X509_TRUSTED_CERT_CALLBACK is not set
# default:
CONFIG_MBEDTLS_ASN1_PARSE_C=y
# default:
CONFIG_MBEDTLS_ASN1_WRITE_C=y
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

#
# Certificate Bundle Configuration
#
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_NONE is not set
# default:
# CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEPRECATED_LIST is not set
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_MAX_CERTS=200
# end of Certificate Bundle Configuration

# default:
# CONFIG_MBEDTLS_ALLOW_WEAK_CERTIFICATE_VERIFICATION is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY is not set
# end of Certificates

# default:
CONFIG_MBEDTLS_TLS_ENABLED=y

#
# TLS Protocol Configuration
#
# default:
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# default:
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_3 is not set
# default:
# CONFIG_MBEDTLS_SSL_PROTO_GMTSSL1_1 is not set
# default:
CONFIG_MBEDTLS_TLS_SERVER=y
# default:
CONFIG_MBEDTLS_TLS_CLIENT=y
# default:
CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
# default:
# CONFIG_MBEDTLS_TLS_SERVER_ONLY is not set
# default:
# CONFIG_MBEDTLS_TLS_CLIENT_ONLY is not set
# default:
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
# default:
# CONFIG_MBEDTLS_SSL_CONTEXT_SERIALIZATION is not set
# default:
CONFIG_MBEDTLS_SSL_CACHE_C=y
# default:
CONFIG_MBEDTLS_SSL_ALL_ALERT_MESSAGES=y

#
# TLS Key Exchange Configuration
#
# default:
# CONFIG_MBEDTLS_PSK_MODES is not set
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ELLIPTIC_CURVE=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
# end of TLS Key Exchange Configuration

# default:
CONFIG_MBEDTLS_SSL_SERVER_NAME_INDICATION=y
# default:
CONFIG_MBEDTLS_SSL_ALPN=y
# default:
CONFIG_MBEDTLS_SSL_MAX_FRAGMENT_LENGTH=y
# default:
# CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH is not set
# default:
CONFIG_MBEDTLS_SSL_RENEGOTIATION=y
# default:
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
# default:
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=y
# default:
# CONFIG_MBEDTLS_SSL_KEYING_MATERIAL_EXPORT is not set
# end of TLS Protocol Configuration

# default:
# CONFIG_MBEDTLS_SSL_PROTO_DTLS is not set

#
# Symmetric Ciphers
#
# default:
CONFIG_MBEDTLS_AES_C=y
# default:
# CONFIG_MBEDTLS_CAMELLIA_C is not set
# default:
# CONFIG_MBEDTLS_ARIA_C is not set
# default:
# CONFIG_MBEDTLS_DES_C is not set
# default:
CONFIG_MBEDTLS_CCM_C=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CBC=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CFB=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CTR=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_OFB=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_XTS=y
# default:
CONFIG_MBEDTLS_GCM_C=y
# default:
# CONFIG_MBEDTLS_NIST_KW_C is not set
# default:
CONFIG_MBEDTLS_AES_ROM_TABLES=y
# default:
# CONFIG_MBEDTLS_AES_FEWER_TABLES is not set
# default:
# CONFIG_MBEDTLS_AES_ONLY_128_BIT_KEY_LENGTH is not set
# default:
CONFIG_MBEDTLS_CMAC_C=y
# end of Symmetric Ciphers

#
# Asymmetric Ciphers
#
# default:
CONFIG_MBEDTLS_RSA_C=y
# default:
CONFIG_MBEDTLS_ECP_C=y

#
# Supported Curves
#
# default:
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=y
# end of Supported Curves

#
# Elliptic Curve Ciphers Configuration
#
# default:
CONFIG_MBEDTLS_ECP_NIST_OPTIM=y
# default:
# CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM is not set
# default:
# CONFIG_MBEDTLS_DHM_C is not set
# default:
CONFIG_MBEDTLS_ECDH_C=y
# default:
# CONFIG_MBEDTLS_ECJPAKE_C is not set
# default:
CONFIG_MBEDTLS_ECDSA_C=y
# default:
CONFIG_MBEDTLS_PK_PARSE_EC_EXTENDED=y
# default:
CONFIG_MBEDTLS_PK_PARSE_EC_COMPRESSED=y
# default:
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y
# default:
# CONFIG_MBEDTLS_ECP_RESTARTABLE is not set
# end of Elliptic Curve Ciphers Configuration
# end of Asymmetric Ciphers

#
# Hash functions
#
# default:
# CONFIG_MBEDTLS_RIPEMD160_C is not set
# default:
CONFIG_MBEDTLS_MD_C=y
# default:
CONFIG_MBEDTLS_MD5_C=y
# default:
CONFIG_MBEDTLS_SHA1_C=y
# default:
# CONFIG_MBEDTLS_SHA224_C is not set
# default:
CONFIG_MBEDTLS_SHA256_C=y
# default:
CONFIG_MBEDTLS_SHA384_C=y
# default:
CONFIG_MBEDTLS_SHA512_C=y
# default:
# CONFIG_MBEDTLS_SHA3_C is not set
# default:
CONFIG_MBEDTLS_ROM_MD5=y
# end of Hash functions

#
# Hardware Acceleration
#
# default:
CONFIG_MBEDTLS_HARDWARE_SHA=y
# CONFIG_MBEDTLS_HARDWARE_MPI is not set
# default:
CONFIG_MBEDTLS_HARDWARE_AES=y
# default:
# CONFIG_MBEDTLS_AES_SOFT_FALLBACK is not set
# default:
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=y
# default:
CONFIG_MBEDTLS_AES_USE_INTERRUPT=y
# default:
CONFIG_MBEDTLS_AES_INTERRUPT_LEVEL=0
# default:
CONFIG_MBEDTLS_AES_HW_SMALL_DATA_LEN_OPTIM=y
# default:
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_SIGN is not set
# default:
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_VERIFY is not set
# default:
CONFIG_MBEDTLS_HARDWARE_RSA_DS_PERIPHERAL=y
# end of Hardware Acceleration

#
# Entropy and Random Number Generation
#
# default:
# CONFIG_MBEDTLS_ENTROPY_FORCE_SHA256 is not set
# default:
CONFIG_MBEDTLS_CTR_DRBG_C=y
# default:
CONFIG_MBEDTLS_HMAC_DRBG_C=y
# end of Entropy and Random Number Generation

#
# Encoding/Decoding
#
# default:
CONFIG_MBEDTLS_BASE64_C=y
# default:
CONFIG_MBEDTLS_PKCS5_C=y
# default:
CONFIG_MBEDTLS_PKCS7_C=y
# default:
CONFIG_MBEDTLS_PKCS1_V15=y
# default:
CONFIG_MBEDTLS_PKCS1_V21=y
# end of Encoding/Decoding

#
# Stream Cipher
#
# default:
# CONFIG_MBEDTLS_CHACHA20_C is not set
# end of Stream Cipher
# end of mbedTLS

#
# NVS
#
# default:
# CONFIG_NVS_ENCRYPTION is not set
# default:
# CONFIG_NVS_ASSERT_ERROR_CHECK is not set
# default:
# CONFIG_NVS_LEGACY_DUP_KEYS_COMPATIBILITY is not set
# default:
# CONFIG_NVS_BDL_STACK is not set
# default:
# CONFIG_NVS_FLASH_VERIFY_ERASE is not set
# end of NVS

#
# OpenThread
#
# default:
# CONFIG_OPENTHREAD_ENABLED is not set

#
# OpenThread Spinel
#
# default:
# CONFIG_OPENTHREAD_SPINEL_ONLY is not set
# end of OpenThread Spinel

# default:
# CONFIG_OPENTHREAD_DEBUG is not set
# end of OpenThread

#
# Protocomm
#
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
# default:
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
# default:
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_PATCH_VERSION=y
# end of Protocomm

#
# PThreads
#
# default:
CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
# default:
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
# default:
CONFIG_PTHREAD_STACK_MIN=768
# default:
CONFIG_PTHREAD_TASK_CORE_DEFAULT=-1
# default:
CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"
# end of PThreads

#
# SD Protocol Layer Configuration
#
# default:
CONFIG_SD_ENABLE_SDIO_SUPPORT=y
# end of SD Protocol Layer Configuration

#
# MMU Config
#
# default:
CONFIG_MMU_PAGE_SIZE_64KB=y
# default:
CONFIG_MMU_PAGE_MODE="64KB"
# default:
CONFIG_MMU_PAGE_SIZE=0x10000
# end of MMU Config

#
# Main Flash configuration
#

#
# SPI Flash behavior when brownout
#
# default:
CONFIG_SPI_FLASH_BROWNOUT_RESET_XMC=y
# default:
CONFIG_SPI_FLASH_BROWNOUT_RESET=y
# end of SPI Flash behavior when brownout

#
# Optional and Experimental Features (READ DOCS FIRST)
#

